<center>Name: Furqan Hameed Khan <br>
Email: hameedfurqan1999@gmail.com <br>
github: hameedfurqan1999 <br>
Title: AI in Tax System </center>

install library

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\buhsci\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\buhsci\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\buhsci\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\buhsci\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\buhsci\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\buhsci\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

Loading data Set

In [3]:
df=pd.read_csv('data.csv')

In [4]:
print(df.head())

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

In [5]:
df.info

<bound method DataFrame.info of              Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0>

In [8]:
df.tail()

      Name Designation Gender    Age    Salary
12   Ahsan     trainer      M  156.0  110000.0
13   Wajid     teacher      M   67.0    2000.0
14   Naeem     trainer      M   80.0   16000.0
15  Qaisar   professor      M   20.0  170000.0
16   Wajid    Engineer      M   85.0  190000.0

In [16]:
df.tail(1)

     Name Designation Gender   Age    Salary
16  Wajid    Engineer      M  85.0  190000.0

In [18]:
df.describe()

             Age        Salary
count   16.00000  1.500000e+01
mean    48.68750  1.725333e+05
std     35.55975  3.713435e+05
min     20.00000  2.000000e+03
25%     27.50000  3.500000e+04
50%     30.00000  7.000000e+04
75%     61.75000  1.150000e+05
max    156.00000  1.500000e+06

In [19]:
df.loc[8]

Name               Eman
Designation    Engineer
Gender                F
Age                28.0
Salary          35000.0
Name: 8, dtype: object

In [20]:
df.isnull().sum

<bound method DataFrame.sum of      Name  Designation  Gender    Age  Salary
0   False        False   False  False   False
1   False        False   False  False   False
2   False        False   False  False   False
3   False        False   False  False   False
4   False        False   False  False   False
5   False        False   False  False    True
6   False        False   False  False   False
7   False        False   False  False   False
8   False        False   False  False   False
9   False        False   False  False    True
10  False        False   False  False   False
11  False        False   False   True   False
12  False        False   False  False   False
13  False        False   False  False   False
14  False        False   False  False   False
15  False        False   False  False   False
16  False        False   False  False   False>

In [22]:
df["Age"].isnull().sum()

np.int64(1)